app/controllers/potin_controller.rb

SELECT "gossips".* FROM "gossips"
---
  def index
    @gossips = Gossip.all

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @gossip = Gossip.find(params[:id]) #on récupère l'id passé en index qui ressort dans le show